/*
  Создать таблицу users,
    в таблице должны быть следующие поля:
      - id
      - first_name
      - last_name
      - email
      - birthday
      - is_male
      - height
      - weight

    Проверки:
      - обязательно что-то должно быть в столбцах id, first_name, last_name, email
      - вес пользователя не может быть больше 800 кг
      - рост не может быть меньше 0.3 м и больше 3 м
      - дата рождения должна иметь смысл
      - емейл должен быть уникальным
      -* комбинация имени и фамилии должна быть уникальной
      - имя и фамилия не могут быть пустой строкой

    Значения по умолчанию:
      - id
      - is_male (true)
      - height (1.65)

*/