/*
    текстовые типы

  text - строка неограниченной переменной длины (полный аналог string из JS)
  'dsadsadsadsasafdsgfdfdsfdfgdhj h dyfd gyudfgdyfg dyfgduyfdfkuyfdsuds'
  ''

  char (x) - строка фиксированной длины х
    char(5)

    '12345'
    '123  '
    '12345'678

  varchar (x) - строка с огрниченной переменной длиной х
    varchar(5)

    '12345'
    '123'
    '12345'6789
*/
--
/*
  числовые типы

  numeric (x,y) - число с точностью X и масштабом Y 

    точность - обще количество цифр в числеs
    масштаб - количество цифр в добной части

    numeric (5,2)
    123.45

    numeric(9,7)
    12.3456789
*/