/*
  SQL делится на 5 подязыков:

  DDL (Data Defenition Language) - язык определения данных, служит для описания структуры данных в БД

  DML (Data Manipulation Language) - язык манипуляции данных, служит для внесения / изменения / удаления записей в БД

  DQL (Data Query Language) - язык запроса данных, служит для получения данных из БД

  DCL (Data Control Lang) - язык контроля данных, содержит команды для администрирования БД

  TCL (Transaction Control Lang) - язык контроля транзакций, нужен для транзакций
*/